# Pandas

## Introduction to pandas data structures

## What is pandas

**pandas** is an open source Python library for data analysis. Python has always been great for prepping and munging data, but it's never been great for analysis - you'd usually end up using R or loading it into a database and using SQL (or worse, Excel). pandas makes Python great for analysis.

First, import numpy and pandas

In [2]:
import pandas as pd  # module for data analysis
import numpy as np  # module for efficient computations


pd.set_option('max_columns', 50)

## pandas data structures

pandas introduces two new data structures to Python which are built on top of NumPy (this means it's fast):

* Series
* DataFrame

## Series

A *Series* is a one-dimensional object similar to an array, list, or column in a table. It will assign a labeled index to each item in the Series. By default, each item will receive an index label from 0 to N, where N is the length of the Series minus one.

In [3]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'])

### Series with index

One can specify an index to use when creating the Series

In [4]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'],
              index=['A', 'Z', 'C', 'Y', 'E'])
s

A                7
Z       Heisenberg
C             3.14
Y      -1789710578
E    Happy Eating!
dtype: object

### Dictionary to Series

The Series constructor can convert a dictionary as well, using the keys of the dictionary as its index.

In [5]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)
print(cities)

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston              NaN
dtype: float64

### Access Series’ elements by index

One can use the index to select specific items from the Series

In [19]:
cities['Chicago']

1400.0

In [20]:
cities[['Chicago', 'Portland', 'San Francisco']]

Chicago          1400.0
Portland          750.0
San Francisco    1100.0
dtype: float64

### Secting elements of a Series using boolean Indexing

You can use boolean indexing for selection.

In [21]:
cities[cities < 1000]

Portland    750.0
Austin      750.0
dtype: float64

### Boolean indexing step by step

Let's examine the created boolean index

Step 1: create a series with boolean values (*boolean index*) where
* `True` corresponds to a value for which `cities < 1000` holds true,
* `False` corresponds to a value for which `cities < 1000` does not hold true

In [22]:
less_than_1000 = cities < 1000
less_than_1000

Chicago          False
New York         False
Portland          True
San Francisco    False
Austin            True
Boston           False
dtype: bool

Step 2:  when the boolean index is applied to the original series, it filters out all elements with boolean index value set to `False`

In [24]:
cities[less_than_1000]

Portland    750.0
Austin      750.0
dtype: float64

### Editing Series’ elements

One can editing Series' elements based on the index

In [25]:
print('Old value:', cities['Chicago'])
cities['Chicago'] = 1400
print('New value:', cities['Chicago'])

Old value: 1400.0
New value: 1400.0

One can edit Series' elements using boolean index

In [26]:
cities

Chicago          1400.0
New York         1300.0
Portland          750.0
San Francisco    1100.0
Austin            750.0
Boston              NaN
dtype: float64

In [27]:
cities[cities < 1000] = 750
cities

Chicago          1400.0
New York         1300.0
Portland          750.0
San Francisco    1100.0
Austin            750.0
Boston              NaN
dtype: float64

### Elements membership

Test for element's membership in a Series

In [28]:
print('Seattle' in cities)
print('San Francisco' in cities)

False
True

### Mathematical operations on elements of Series

Mathematical operations can be done using scalars and functions

In [29]:
cities / 3

Chicago          466.666667
New York         433.333333
Portland         250.000000
San Francisco    366.666667
Austin           250.000000
Boston                  NaN
dtype: float64

In [30]:
np.square(cities)

Chicago          1960000.0
New York         1690000.0
Portland          562500.0
San Francisco    1210000.0
Austin            562500.0
Boston                 NaN
dtype: float64

## Adding Series

Adding two Series together returns a union of the two Series with the addition occurring on the **shared** index values. Values on either Series that did not have a shared index will produce a NULL/NaN (not a number)

In [31]:
cities[['Chicago', 'New York']]

Chicago     1400.0
New York    1300.0
dtype: float64

In [32]:
cities[['Austin', 'New York']]

Austin       750.0
New York    1300.0
dtype: float64

In [33]:
cities[['Chicago', 'New York']] + cities[['Austin', 'New York']]

Austin         NaN
Chicago        NaN
New York    2600.0
dtype: float64

## DataFrame

A DataFrame is a tabular data structure comprised of rows and columns, akin to a spreadsheet, database table, or R's data.frame object. You can also think of a DataFrame as a group of Series objects that share an index (the column names).

### Reading data into DataFrame

There are multiple ways to inirialize a DataFrame

* Dictionary -> DataFrame
* CSV file -> DataFrame
* Relational Database -> DataFrame
* Clipboard -> DataFrame
* URL -> DataFrame

#### Dictionary -> DataFrame

To create a DataFrame pass a dictionary of lists to the DataFrame constructor

In [34]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

#### CSV file -> DataFrame

Reading a CSV is as simple as calling the pandas [`read_csv`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html) function. By default, the [`read_csv`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html) function expects the column separator to be a comma, but you can change that using the sep parameter.

In [35]:
url = 'https://raw.githubusercontent.com/evdoks/data_science/' \
      'master/data/fugitives.csv'
from_csv = pd.read_csv(url)
from_csv.head()

,Fugitive,Nationality,Wanted by,Wanted for,Details of reason wanted for,Country believed to be in / Country of capture,Date of Birth,Current Age (approx.),Sex,Status,Details,Year of Interpol operation,Source,Interpol Red Notice Profile,Image
0,Viktoryia TSUNIK,Belarus,Belarus,"Theft, Fraud",Theft by abuse of power,"Angola, Europe, Russia, Ukraine",1961.0,53.0,Female,Free,"Founder of the ""Tsunik"" company in Vitebsk, Be...",2012,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
1,Adriano GIACOBONE,Italy,Italy,"Kidnapping, Possession of firearms and/or expl...","Kidnapping, illegal detention and carrying of ...","Argentina, France, Morocco, Paraguay, Spain",1957.0,57.0,Male,Free,"Among a series of court judgments, GIACOBONE h...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
2,Sudiman SUNOTO,Indonesia,Indonesia,"Illegal Logging, Environmental Crimes",Illegal logging,Asia,1962.0,52.0,Male,Free,"On 11 November 2006, the Indonesian Criminal I...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
3,David Macdonald CARROL,Canada,Canada,"Murder, Attempted Murder, Drug Crimes","Murder, Conspiracy to murder, drug trafficking...","Australia, Brazil, Europe, Mexico, New Zealand...",1952.0,62.0,Male,Free,CARROL is a member of the Quebec Nomads Chapte...,"2012, 2010",www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
4,Jason HOLLAND,"United Kingdom, South Africa",South Africa,Fraud,Fraud,"Australia, United Kingdom, The Netherlands",1967.0,47.0,Male,Free,In 2007 HOLLAND was employed as a Financial D...,2010,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...

Creating DataFrame from a subset of columns of CSV file

In [36]:
cols = ['Fugitive', 'Nationality', 'Wanted by']
no_headers = pd.read_csv(url, sep=',', usecols=cols)
no_headers.head()

                 Fugitive                   Nationality     Wanted by
0        Viktoryia TSUNIK                       Belarus       Belarus
1       Adriano GIACOBONE                         Italy         Italy
2          Sudiman SUNOTO                     Indonesia     Indonesia
3  David Macdonald CARROL                        Canada        Canada
4           Jason HOLLAND  United Kingdom, South Africa  South Africa

Saving DataFrame as CSV file

In [37]:
no_headers.to_csv('~/fugitives_brief.csv')

#### Clipboard -> DataFrame

Creating DataFrame from CSV data in clipboard: copy a fragment of https://raw.githubusercontent.com/evdoks/data_science/master/data/fugitives.csv into clpiboard

In [3]:
foo = pd.read_clipboard(sep=',')
foo.head()

,Fugitive,Nationality,Wanted by,Wanted for,Details of reason wanted for,Country believed to be in / Country of capture,Date of Birth,Current Age (approx.),Sex,Status,Details,Year of Interpol operation,Source,Interpol Red Notice Profile,Image
0,Viktoryia TSUNIK,Belarus,Belarus,"Theft, Fraud",Theft by abuse of power,"Angola, Europe, Russia, Ukraine",1961.0,53.0,Female,Free,"Founder of the ""Tsunik"" company in Vitebsk, Be...",2012,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
1,Adriano GIACOBONE,Italy,Italy,"Kidnapping, Possession of firearms and/or expl...","Kidnapping, illegal detention and carrying of ...","Argentina, France, Morocco, Paraguay, Spain",1957.0,57.0,Male,Free,"Among a series of court judgments, GIACOBONE h...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
2,Sudiman SUNOTO,Indonesia,Indonesia,"Illegal Logging, Environmental Crimes",Illegal logging,Asia,1962.0,52.0,Male,Free,"On 11 November 2006, the Indonesian Criminal I...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
3,David Macdonald CARROL,Canada,Canada,"Murder, Attempted Murder, Drug Crimes","Murder, Conspiracy to murder, drug trafficking...","Australia, Brazil, Europe, Mexico, New Zealand...",1952.0,62.0,Male,Free,CARROL is a member of the Quebec Nomads Chapte...,"2012, 2010",www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
4,Jason HOLLAND,"United Kingdom, South Africa",South Africa,Fraud,Fraud,"Australia, United Kingdom, The Netherlands",1967.0,47.0,Male,Free,In 2007 HOLLAND was employed as a Financial D...,2010,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...

#### URL -> DataFrame

With pandas `read_table` function, we can also read directly from a URL pointing to a delimited data (e.g., remote CSV file)

In [40]:
url = 'https://raw.githubusercontent.com/evdoks/data_science/' \
      'master/data/fugitives.csv'

# fetch the text from the URL and read it into a DataFrame
from_url = pd.read_table(url, sep=',')
from_url.head(3)

,Fugitive,Nationality,Wanted by,Wanted for,Details of reason wanted for,Country believed to be in / Country of capture,Date of Birth,Current Age (approx.),Sex,Status,Details,Year of Interpol operation,Source,Interpol Red Notice Profile,Image
0,Viktoryia TSUNIK,Belarus,Belarus,"Theft, Fraud",Theft by abuse of power,"Angola, Europe, Russia, Ukraine",1961.0,53.0,Female,Free,"Founder of the ""Tsunik"" company in Vitebsk, Be...",2012,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
1,Adriano GIACOBONE,Italy,Italy,"Kidnapping, Possession of firearms and/or expl...","Kidnapping, illegal detention and carrying of ...","Argentina, France, Morocco, Paraguay, Spain",1957.0,57.0,Male,Free,"Among a series of court judgments, GIACOBONE h...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
2,Sudiman SUNOTO,Indonesia,Indonesia,"Illegal Logging, Environmental Crimes",Illegal logging,Asia,1962.0,52.0,Male,Free,"On 11 November 2006, the Indonesian Criminal I...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...

#### Database -> DataFrame

pandas also has some support for reading/writing DataFrames directly from/to a database.

You'll typically just need to pass a *connection object* or [*sqlalchemy engine*](https://www.sqlalchemy.org) to the `read_sql` or `to_sql` functions within the `pandas.io` module.

```python
from pandas.io import sql
import psycopg2

conn = conn = psycopg2.connect('postgres://user:password@host/db')
query = "SELECT * FROM towed WHERE make = 'FORD';"

results = sql.read_sql(query, con=conn)
results.head()
```

# Working with DataFrames

## MovieLens Dataset

[MovieLens dataset](https://grouplens.org/datasets/movielens/) contains 100,000 ratings made by 943 users on 1,682 movies.

In [42]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('https://raw.githubusercontent.com/evdoks/data_science/'
                    'master/data/ml-100k/u.user', sep='|', names=u_cols,
                    encoding='latin-1')
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [43]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('https://raw.githubusercontent.com/evdoks/data_science/'
                      'master/data/ml-100k/u.data', sep='\t', names=r_cols,
                      encoding='latin-1')
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [44]:
# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 
          'imdb_url']
movies = pd.read_csv('https://raw.githubusercontent.com/evdoks/data_science/'
                     'master/data/ml-100k/u.item', sep='|', names=m_cols, 
                     usecols=range(5), encoding='latin-1')
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

## DataFrame Inspection

pandas has a variety of functions for getting basic information about your DataFrame.

The most basic information about a data frame is returned by `.info()` method.

In [45]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 5 columns):
movie_id              1682 non-null int64
title                 1682 non-null object
release_date          1681 non-null object
video_release_date    0 non-null float64
imdb_url              1679 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 65.8+ KB

Information about attributes of a DataFrame and their data types is stored in `.dtype` attribute.

In [47]:
movies.dtypes

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

DataFrame's also have `.describe()` method, which is outputs basic statistics about the dataset's numeric columns.

In [48]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

## Outputting DataFrame

`.head()` displays the first five records of the dataset

In [49]:
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

`.tail()` displays the first five records of the dataset

In [50]:
movies.tail()

,movie_id,title,release_date,video_release_date,imdb_url
1677,1678,Mat' i syn (1997),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?Mat%27+i+syn+...
1678,1679,B. Monkey (1998),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?B%2E+Monkey+(...
1679,1680,Sliding Doors (1998),01-Jan-1998,NaN,http://us.imdb.com/Title?Sliding+Doors+(1998)
1680,1681,You So Crazy (1994),01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?You%20So%20Cr...
1681,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,NaN,http://us.imdb.com/M/title-exact?Schrei%20aus%...

Python's regular slicing syntax works as well

In [51]:
movies[20:22]

,movie_id,title,release_date,video_release_date,imdb_url
20,21,Muppet Treasure Island (1996),16-Feb-1996,NaN,http://us.imdb.com/M/title-exact?Muppet%20Trea...
21,22,Braveheart (1995),16-Feb-1996,NaN,http://us.imdb.com/M/title-exact?Braveheart%20...

## Columns

Selecting a single column from the DataFrame will return a Series object.

In [52]:
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

To select multiple columns, simply pass a list of column names to the DataFrame, the output of which will be a DataFrame.

In [53]:
users[['age', 'zip_code']].head()

   age zip_code
0   24    85711
1   53    94043
2   23    32067
3   24    43537
4   33    15213

Storing column names in a variable

In [54]:
columns_you_want = ['occupation', 'sex'] 
users[columns_you_want].head()

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

## Selecting DataFrame rows using boolean indexing

Similar to numpy arrays or pandas Series, boolean indexing can be used for selecting rows of a DataFrame based on a boolean condition.

In [55]:
# users older than 25
users[users.age > 25].head(3)

   user_id  age sex occupation zip_code
1        2   53   F      other    94043
4        5   33   F      other    15213
5        6   42   M  executive    98101

In [56]:
# users aged 40 AND male
users[(users.age == 40) & (users.sex == 'M')].head(3)

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232

In [57]:
users[(users.sex == 'F') | (users.age < 30)].head(3)

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067

## Index of a data frame

* In pandas data frames, each row has a name. Those names build up an *index* of the data frame.
* By default, this label is just the row number.
* A column can be set to be the index of your DataFrame, which means that its values will be used as row labels.
* Values of a data frame's index do *not* have to be *unique*.

Use `.loc[]` to choose rows and columns by label.

In [58]:
users.loc[100]

user_id           101
age                15
sex                 M
occupation    student
zip_code        05146
Name: 100, dtype: object

In [59]:
users.loc[[2, 51, 301]]

     user_id  age sex occupation zip_code
2          3   23   M     writer    32067
51        52   18   F    student    55105
301      302   42   M   educator    77904

In [61]:
users.loc[[2, 51, 301], ['age', 'sex']]

     age sex
2     23   M
51    18   F
301   42   M

Use `.iloc[]` to choose rows and columns by position.

In [67]:
users.iloc[100]

user_id           101
age                15
sex                 M
occupation    student
zip_code        05146
Name: 100, dtype: object

### Reindexing a DataFrame

Reindexing of DataFrame meand setting a new index.

* `.set_index()` returns a new DataFrame with a new index,
* reindexing does not change the original dataframe.

In [68]:
users.set_index('user_id').head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

In [69]:
# the original data frame was not changed
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

`set_index` actually returns a new DataFrame

In [70]:
with_new_index = users.set_index('user_id')
with_new_index.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

Use `inplace=True` to modify an existing DataFrame.

In [71]:
users.set_index('user_id', inplace=True)
users.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

Let's now check `.iloc[]`

In [76]:
users.loc[100]

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object

In [78]:
# use .iloc[99] to get the same row as users.loc[100] returns
users.iloc[100]

age                15
sex                 M
occupation    student
zip_code        05146
Name: 101, dtype: object

## Reset index

Index of a data frame can be reset to incremental numbers by using `.reset_index()`

In [79]:
users.reset_index(inplace=True)
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

# Merging (joining) data frames

## Joins in relational databases

Before looking at how data frames can be merged, let's recall how joins work in relational databases.

An SQL join clause combines columns from one or more tables in a relational database.

We will consider following types of a join:

* inner join
* left join
* right join
* outer join

## Sample data

| LastName   | DepartmentID |
|------------|--------------|
| Rafferty   | 31           |
| Jones      | 33           |
| Heisenberg | 33           |
| Robinson   | 34           |
| Smith      | 34           |
| Willams    | NULL         |

| DepartmentID | DepartmentName |
|--------------|----------------|
| 31           | Sales          |
| 33           | Engineering    |
| 34           | Clerical       |
| 35           | Marketing      |

## Inner join

* An *inner join* requires each row in the two joined tables to have matching column values, and is a commonly used join operation
* Inner join creates a new result table by combining column values of two tables (A and B) based upon the *join condition*
* The query compares each row of A with each row of B to find all pairs of rows which satisfy the join-condition. When the join-condition is satisfied by matching non-NULL values, column values for each matched pair of rows of A and B are combined into a result row.

## Inner join example

| LastName   | DepartmentID |
|------------|--------------|
| Rafferty   | 31           |
| Jones      | 33           |
| Heisenberg | 33           |
| Robinson   | 34           |
| Smith      | 34           |
| Willams    | NULL         |

| DepartmentID | DepartmentName |
|--------------|----------------|
| 31           | Sales          |
| 33           | Engineering    |
| 34           | Clerical       |
| 35           | Marketing      |

```SQL
SELECT employee.LastName, employee.DepartmentID, department.DepartmentName 
FROM employee 
INNER JOIN department ON
employee.DepartmentID = department.DepartmentID
```

| LastName   | DepartmentID | DepartmentName |
|------------|--------------|----------------|
| Rafferty   | 31           |Sales           |
| Jones      | 33           |Engineering     |
| Heisenberg | 33           |Engineering     |
| Robinson   | 34           |Clerical        |
| Smith      | 34           |Clerical        |

## Outer join

The outer joined resultingtable retains rows even if no other matching row exists.

There three different outer join types:

* left outer join
* right outer join
* full outer join

## Left outer join

*Left outer join* returns all the values from an inner join plus all values in the left table that do not match to the right table, including rows with NULL (empty) values in the link column.

| LastName   | DepartmentID |
|------------|--------------|
| Rafferty   | 31           |
| Jones      | 33           |
| Heisenberg | 33           |
| Robinson   | 34           |
| Smith      | 34           |
| Willams    | NULL         |

| DepartmentID | DepartmentName |
|--------------|----------------|
| 31           | Sales          |
| 33           | Engineering    |
| 34           | Clerical       |
| 35           | Marketing      |

```SQL
SELECT *
FROM employee e
LEFT OUTER JOIN department d ON e.DepartmentID = d.DepartmentID;
```

| LastName   | DepartmentID | DepartmentName |
|------------|--------------|----------------|
| Rafferty   | 31           |Sales           |
| Jones      | 33           |Engineering     |
| Heisenberg | 33           |Engineering     |
| Robinson   | 34           |Clerical        |
| Smith      | 34           |Clerical        |
| Williams   | NULL         |NULL            |

## Right outer join

*Right outer join* returns all the values from an inner join plus all values in the right table that do not match to the left table, including rows with NULL (empty) values in the right column.

## Right outer join example

| LastName   | DepartmentID |
|------------|--------------|
| Rafferty   | 31           |
| Jones      | 33           |
| Heisenberg | 33           |
| Robinson   | 34           |
| Smith      | 34           |
| Willams    | NULL         |

| DepartmentID | DepartmentName |
|--------------|----------------|
| 31           | Sales          |
| 33           | Engineering    |
| 34           | Clerical       |
| 35           | Marketing      |

```SQL
SELECT *
FROM employee e RIGHT OUTER JOIN department d ON e.DepartmentID = d.DepartmentID;
```

| LastName   | DepartmentID | DepartmentName |
|------------|--------------|----------------|
| Rafferty   | 31           |Sales           |
| Jones      | 33           |Engineering     |
| Heisenberg | 33           |Engineering     |
| Robinson   | 34           |Clerical        |
| Smith      | 34           |Clerical        |
| NULL       | NULL         |Marketing       |

## Full outer join

*Full outer join* combines the effect of applying both left and right outer joins. 

Where rows in the FULL OUTER JOINed tables do not match, the result set will have NULL values for every column of the table that lacks a matching row.

## Full outer join example

| LastName   | DepartmentID |
|------------|--------------|
| Rafferty   | 31           |
| Jones      | 33           |
| Heisenberg | 33           |
| Robinson   | 34           |
| Smith      | 34           |
| Willams    | NULL         |

| DepartmentID | DepartmentName |
|--------------|----------------|
| 31           | Sales          |
| 33           | Engineering    |
| 34           | Clerical       |
| 35           | Marketing      |

```SQL
SELECT *
FROM employee e FULL OUTER JOIN department d
  ON e.DepartmentID = d.DepartmentID;
```

| LastName   | DepartmentID | DepartmentName |
|------------|--------------|----------------|
| Rafferty   | 31           |Sales           |
| Jones      | 33           |Engineering     |
| Heisenberg | 33           |Engineering     |
| Robinson   | 34           |Clerical        |
| Smith      | 34           |Clerical        |
| NULL       | NULL         |Marketing       |
| Williams   | NULL         |NULL            |

## Joining with pandas using `merge()`

* `pandas.merge()` allows two DataFrames to be joined on one or more keys 
*  `pandas.merge()` function provides a series of parameters (`on`, `left_on`, `right_on`, `left_index`, `right_index`) allowing you to specify the columns or indexes on which to join
* by default, `pandas.merge()` operates as an inner join

## Sample data

In [5]:
df_employee = pd.DataFrame(
{'LastName': ['Rafferty', 'Jones', 'Heisenberg', 'Robinson', 
      'Smith', 'Williams'],
'DepartmentId': [31, 33, 33, 34, 34, np.nan]
})

df_department = pd.DataFrame(
  {'DepartmentName': ['Sales', 'Engineering', 'Clerical', 
   'Marketing']}, 
  index = [31, 33, 34, 35]
)

In [6]:
df_employee

     LastName  DepartmentId
0    Rafferty          31.0
1       Jones          33.0
2  Heisenberg          33.0
3    Robinson          34.0
4       Smith          34.0
5    Williams           NaN

In [85]:
df_department

   DepartmentName
31          Sales
33    Engineering
34       Clerical
35      Marketing

## Inner join using `merge()`

In [86]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
         right_index=True, how='inner')

     LastName  DepartmentId DepartmentName
0    Rafferty          31.0          Sales
1       Jones          33.0    Engineering
2  Heisenberg          33.0    Engineering
3    Robinson          34.0       Clerical
4       Smith          34.0       Clerical

## Left outer join using `merge()`

In [87]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
         right_index=True, how='left')

     LastName  DepartmentId DepartmentName
0    Rafferty          31.0          Sales
1       Jones          33.0    Engineering
2  Heisenberg          33.0    Engineering
3    Robinson          34.0       Clerical
4       Smith          34.0       Clerical
5    Williams           NaN            NaN

## Right outer join using `merge()`

In [88]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
         right_index=True, how='right')

       LastName  DepartmentId DepartmentName
0.0    Rafferty          31.0          Sales
1.0       Jones          33.0    Engineering
2.0  Heisenberg          33.0    Engineering
3.0    Robinson          34.0       Clerical
4.0       Smith          34.0       Clerical
NaN         NaN          35.0      Marketing

## Full outer join using `merge()`

In [89]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
         right_index=True, how='outer')

       LastName  DepartmentId DepartmentName
0.0    Rafferty          31.0          Sales
1.0       Jones          33.0    Engineering
2.0  Heisenberg          33.0    Engineering
3.0    Robinson          34.0       Clerical
4.0       Smith          34.0       Clerical
5.0    Williams           NaN            NaN
NaN         NaN          35.0      Marketing

## Combining DataFrames

pandas also provides a way to combine DataFrames using `pandas.concat()`

By default, the function will vertically append the objects to one another, combining columns with the same name. We can see above that values not matching up will be NULL.

In [7]:
df_employee_1 = pd.DataFrame(
            {'LastName': ['Guenther', 'Schulz'],
             'DepartmentId': [31, 33]} 
        )
pd.concat([df_employee, df_employee_1])

     LastName  DepartmentId
0    Rafferty          31.0
1       Jones          33.0
2  Heisenberg          33.0
3    Robinson          34.0
4       Smith          34.0
5    Williams           NaN
0    Guenther          31.0
1      Schulz          33.0

In [8]:
pd.concat([df_employee, df_department])

C:\Users\96ank\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    DepartmentId DepartmentName    LastName
0           31.0            NaN    Rafferty
1           33.0            NaN       Jones
2           33.0            NaN  Heisenberg
3           34.0            NaN    Robinson
4           34.0            NaN       Smith
5            NaN            NaN    Williams
31           NaN          Sales         NaN
33           NaN    Engineering         NaN
34           NaN       Clerical         NaN
35           NaN      Marketing         NaN

# Grouping and aggregating DataFrames

## Sample data

In [9]:
df = pd.DataFrame({'A': ['two', 'one', 'three', 'one', 'three', 'one'], 
                   'B': range(6)})
df

       A  B
0    two  0
1    one  1
2  three  2
3    one  3
4  three  4
5    one  5

## Groping rows of a data frame with `groupby` method

pandas groupby returns a `DataFrameGroupBy` object which has a variety of methods, many of which are similar to standard SQL aggregate functions.

In [10]:
df.groupby('A')

In [11]:
df.groupby('A').groups

{'one': Int64Index([1, 3, 5], dtype='int64'),
 'three': Int64Index([2, 4], dtype='int64'),
 'two': Int64Index([0], dtype='int64')}

## Aggregate grouped data frame

### `count()`

Calling `DataFrameGroupBy.count()` method of calculates the total number of NOT NULL values within each group and returns a data frame

In [119]:
df.groupby('A').count()

       B
A
one    3
three  2
two    1

### `DataFrameGroupBy.size()`

Calling `DataFrameGroupBy.size()` calculates total records within each group and returns a Series.

In [122]:
df.groupby('A').size()

A
one      3
three    2
two      1
dtype: int64

### `DataFrameGroupBy.sum()`

Calling `DataFrameGroupBy.sum()` calculates sum of all numerical columns within each group.

In [125]:
df.groupby('A').sum()

       B
A
one    9
three  6
two    0

### `DataFrameGroupBy.mean()`

Calling `DataFrameGroupBy.mean()` calculates mean of all numerical columns within each group.

In [126]:
df.groupby('A').mean()

       B
A
one    3
three  3
two    0

### `DataFrameGroupBy.median()`

Calling `DataFrameGroupBy.mean()` calculates median withing each group.

Get median salary of each department

In [128]:
df.groupby('A').median()

       B
A
one    3
three  3
two    0

## Grouping a bigger dataset

Load City of Chicago dataset

In [129]:
url = 'https://raw.githubusercontent.com/evdoks/data_science/' \
      'master/data/city-of-chicago-salaries.csv'
headers = ['name', 'title', 'department', 'salary']
chicago = pd.read_csv(url, sep=',', header=0, 
                      names=headers, 
                      converters =   
                        {'salary': lambda x: float(x.replace('$', ''))}
                      )
chicago.head()

                    name                     title        department   salary
0        AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT  85512.0
1      AARON,  JEFFERY M            POLICE OFFICER            POLICE  75372.0
2    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES  80916.0
3    ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  99648.0
4  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION  89440.0

In [130]:
by_dept = chicago.groupby('department')
by_dept.groups

{'ADMIN HEARNG': Int64Index([   94,  2832,  2872,  3028,  3362,  4257,  8085,  8144,  8874,
              9846, 10003, 10201, 10258, 10738, 10843, 11950, 12046, 13270,
             13274, 13359, 14123, 14585, 15648, 18483, 18644, 18681, 20536,
             21814, 24217, 24222, 24297, 25598, 26106, 26266, 26380, 26543,
             26919, 28126, 28244, 30465, 30803, 31413],
            dtype='int64'),
 'ANIMAL CONTRL': Int64Index([  199,   210,   405,   489,   500,  1153,  1647,  2667,  2698,
              3133,  3718,  3896,  3910,  4707,  5254,  5821,  6745,  6816,
              6892,  7435,  7797,  7812,  7927,  8124,  9100,  9784, 10511,
             11145, 11347, 11567, 12187, 12548, 12594, 12812, 13432, 14609,
             16528, 16825, 16829, 18224, 18931, 19712, 20079, 22565, 22886,
             23535, 24402, 25667, 27772, 28196, 28444, 29124, 30122, 30279,
             30351, 30400, 30945, 31603, 31730, 31873, 31891],
            dtype='int64'),
 'AVIATION': Int64Index([    4,    40,    72,    85,    95,   115,   146,   177,   205,
               232,
             ...
             31927, 31963, 31974, 31983, 31986, 31996, 31997, 32014, 32019,
             32043],
            dtype='int64', length=1218),
 'BOARD OF ELECTION': Int64Index([  208,   271,  1065,  1094,  1281,  1445,  1632,  1661,  1826,
              1846,
             ...
             28972, 28973, 28974, 28975, 29049, 29165, 29586, 31000, 31027,
             31760],
            dtype='int64', length=110),
 'BOARD OF ETHICS': Int64Index([1982, 4249, 5196, 7902, 13309, 13848, 18916, 22992, 27943], dtype='int64'),
 'BUDGET & MGMT': Int64Index([  269,  1279,  2500,  3304,  3824,  4646,  6766,  6998,  8171,
              8754, 10245, 10459, 11336, 11402, 12346, 12635, 13315, 13669,
             15574, 15684, 16020, 17339, 18078, 18424, 18578, 19067, 19080,
             20280, 21306, 21378, 22129, 22640, 22866, 24002, 24307, 24794,
             26301, 26403, 26580, 27338, 27568, 28174, 29681, 30750],
            dtype='int64'),
 'BUILDINGS': Int64Index([  134,   135,   151,   410,   485,   539,   605,   644,   849,
              1084,
             ...
             30151, 30203, 30444, 30824, 30970, 31298, 31382, 31386, 31507,
             31635],
            dtype='int64', length=242),
 'BUSINESS AFFAIRS': Int64Index([   27,    70,   116,   138,   158,   172,   240,   319,   399,
               528,
             ...
             30747, 30833, 30871, 31094, 31194, 31404, 31580, 31648, 31713,
             31848],
            dtype='int64', length=181),
 'CITY CLERK': Int64Index([  206,   524,   577,   632,  1103,  1388,  1399,  1406,  1433,
              1554,  1853,  2068,  2462,  3016,  3745,  4440,  5248,  5487,
              5570,  5787,  6562,  6619,  7123,  7127,  7464,  7975,  8137,
              8831,  8846,  9074,  9222,  9532, 10176, 10480, 11323, 11378,
             12412, 12529, 12656, 13302, 13509, 13545, 13552, 13749, 13775,
             14580, 14909, 15456, 15602, 15731, 16407, 16917, 17396, 17605,
             18826, 18875, 19060, 19101, 19800, 19976, 20579, 21236, 21568,
             21969, 22512, 22693, 22713, 22721, 22872, 22928, 23532, 23730,
             23837, 24227, 24349, 25406, 25593, 25928, 25962, 27854, 28123,
             28709, 28932, 29259, 30046, 31321],
            dtype='int64'),
 'CITY COUNCIL': Int64Index([   17,    23,   159,   244,   259,   393,   498,   616,   713,
               769,
             ...
             31061, 31155, 31381, 31385, 31441, 31613, 31782, 31807, 31854,
             31944],
            dtype='int64', length=378),
 'COMMUNITY DEVELOPMENT': Int64Index([  124,   257,   309,  1396,  1594,  1637,  1693,  1715,  1977,
              2140,
             ...
             30488, 30596, 30862, 30909, 31180, 31363, 31380, 31502, 31552,
             31652],
            dtype='int64', length=207),
 'CULTURAL AFFAIRS': Int64Index([  107,   438,   936,  1236,  1670,  2473,  3116,  3477,  3972,
              4427,  4455,  4490,  4546,  6040,  6077,  6377,  6800,  7107,
              7616,  7839,  8153,  9221,  9831,  9879, 10627, 10715, 10929,
             10947, 11289, 11969, 12104, 12306, 12433, 12724, 13416, 13769,
             14168, 14732, 15156, 16747, 16929, 16930, 17041, 17141, 17264,
             17783, 17933, 18174, 18494, 18755, 18881, 19031, 19079, 19129,
             19809, 19847, 20577, 20947, 21881, 22816, 23800, 23908, 24263,
             24354, 24557, 25283, 25393, 25909, 26723, 27637, 28471, 28896,
             29039, 29872, 29930, 30266, 31745, 31763, 31892],
            dtype='int64'),
 'DISABILITIES': Int64Index([  325,   440,   935,  2368,  4110,  7096, 10737, 11622, 12179,
             12761, 13467, 14821, 15466, 15970, 16500, 16649, 19587, 20632,
             21650, 21668, 24743, 25024, 25123, 25427, 27575, 28162, 28291,
             31777, 31889],
            dtype='int64'),
 'DoIT': Int64Index([  428,   626,   689,   881,  1337,  1497,  1983,  2062,  2199,
              3089,  4297,  5000,  5035,  5161,  5339,  5548,  6531,  6876,
              7583,  8349,  9132,  9538,  9543,  9551,  9700,  9701,  9735,
             10171, 10410, 11411, 11425, 11681, 11905, 11991, 12475, 13034,
             13134, 14953, 15003, 15871, 15945, 16193, 16215, 16234, 16398,
             17362, 17369, 17634, 18552, 18824, 19155, 19203, 19285, 19354,
             19523, 19572, 19583, 19593, 19627, 19659, 19781, 19929, 20582,
             20610, 20645, 20834, 21327, 21470, 21688, 23522, 23864, 23982,
             24229, 24434, 24984, 25524, 25650, 25779, 25835, 26363, 26603,
             27271, 27327, 27484, 27671, 27864, 27936, 27937, 28317, 28354,
             28522, 29041, 29903, 29998, 30239, 31006, 31390, 31597, 32053],
            dtype='int64'),
 'FAMILY & SUPPORT': Int64Index([    7,    25,    37,   104,   270,   293,   382,   543,   686,
               711,
             ...
             31571, 31594, 31633, 31660, 31661, 31682, 31704, 31752, 31796,
             31913],
            dtype='int64', length=727),
 'FINANCE': Int64Index([   92,   144,   161,   296,   384,   439,   459,   464,   467,
               507,
             ...
             31506, 31672, 31678, 31703, 31746, 31754, 31789, 31866, 31934,
             32039],
            dtype='int64', length=520),
 'FIRE': Int64Index([    5,    12,    15,    18,    19,    31,    32,    38,    59,
                60,
             ...
             31994, 31999, 32000, 32011, 32012, 32013, 32017, 32029, 32031,
             32045],
            dtype='int64', length=4731),
 'GENERAL SERVICES': Int64Index([    2,    21,    67,    87,   126,   129,   277,   298,   321,
               322,
             ...
             31907, 31917, 31959, 31993, 32004, 32010, 32023, 32034, 32048,
             32049],
            dtype='int64', length=913),
 'HEALTH': Int64Index([   36,    42,    57,   108,   132,   140,   155,   163,   165,
               179,
             ...
             31422, 31465, 31623, 31626, 31702, 31737, 31739, 31822, 31887,
             31939],
            dtype='int64', length=573),
 'HUMAN RELATIONS': Int64Index([  896,  4267, 11069, 13981, 13988, 16023, 18707, 19849, 20499,
             20686, 20841, 24300, 24745, 25348, 25967, 26519, 30037, 30677],
            dtype='int64'),
 'HUMAN RESOURCES': Int64Index([  391,   801,   825,  1652,  2602,  2760,  3454,  3927,  4684,
              5304,  5322,  5719,  6581,  6723,  6789,  7763,  8020,  8476,
              8686,  9145,  9716, 11551, 12040, 12690, 12813, 14153, 15616,
             15766, 16128, 16362, 16851, 17000, 17507, 17511, 18285, 18933,
             19139, 19154, 19464, 19509, 19766, 19933, 20669, 20860, 21525,
             22317, 23038, 23090, 23489, 24509, 24755, 25635, 26357, 26659,
             26816, 26818, 26849, 27762, 28064, 28502, 28734, 29615, 30195,
             30668, 30965, 31212, 31292, 31373],
            dtype='int64'),
 'INSPECTOR GEN': Int64Index([  907,  2400,  3084,  6187,  6438,  7729,  8070,  8252,  8493,
              8785,  8871,  9466, 10145, 10721, 11705, 12032, 12533, 13143,
             13712, 14047, 14358, 16344, 17393, 17515, 18671, 18935, 19253,
             19908, 20117, 20450, 20475, 20503, 20881, 21413, 21514, 22112,
             22423, 23452, 23928, 23987, 25628, 25695, 26121, 26534, 28706,
             29096, 29373, 29562, 29760, 30549],
            dtype='int64'),
 'IPRA': Int64Index([    9,   640,   654,   766,  1029,  2576,  3003,  3192,  3811,
              4205,  4243,  4621,  5670,  5987,  6330,  6448,  6456,  6497,
              6539,  6653,  6848,  8656,  8768,  9140, 10279, 10479, 11841,
             11907, 12015, 12191, 12456, 12461, 12667, 12814, 13023, 13276,
             13405, 14199, 14382, 14402, 14876, 15045, 15129, 15526, 15573,
             16167, 16188, 16442, 16571, 16614, 16900, 17018, 17632, 17755,
             18317, 18882, 18896, 19724, 19887, 20358, 20469, 20792, 21139,
             21221, 22987, 23176, 23860, 23968, 24261, 25431, 25484, 26268,
             27176, 27589, 27700, 28438, 28483, 28792, 28902, 29553, 30419,
             30452, 30659, 31085, 31172],
            dtype='int64'),
 'LAW': Int64Index([   76,    89,   130,   196,   273,   279,   333,   542,   574,
               638,
             ...
             31406, 31423, 31496, 31509, 31598, 31608, 31622, 31881, 31938,
             32040],
            dtype='int64', length=450),
 'LICENSE APPL COMM': Int64Index([11154], dtype='int64'),
 "MAYOR'S OFFICE": Int64Index([   52,   389,  1234,  3804,  4009,  4325,  4589,  4826,  5217,
              5427,  5538,  6536,  6845,  6853,  7001,  7491,  7498,  8004,
              8062,  8105,  8276,  8402,  8680,  9342,  9577, 10206, 10778,
             10999, 11264, 11361, 11458, 11481, 11529, 11688, 12076, 12114,
             13089, 13868, 14243, 15146, 15261, 15278, 15441, 15514, 15936,
             16046, 16182, 16373, 16580, 17124, 17918, 18003, 19324, 19393,
             19897, 20398, 20402, 20413, 20952, 21310, 21687, 21778, 22447,
             22729, 23324, 23486, 24005, 24051, 24202, 24381, 24504, 24515,
             24572, 24681, 24861, 24937, 25021, 25379, 25885, 25981, 26176,
             26506, 26684, 26992, 27270, 27279, 28014, 28402, 28745, 29154,
             29365, 29745, 29966, 30339, 30462, 30587, 31251, 31312, 32003],
            dtype='int64'),
 'OEMC': Int64Index([   14,    28,   156,   160,   167,   169,   286,   314,   328,
               332,
             ...
             31738, 31740, 31799, 31833, 31838, 31903, 31947, 31956, 31966,
             32037],
            dtype='int64', length=1292),
 'POLICE': Int64Index([    1,     6,     8,    10,    11,    13,    20,    22,    30,
                39,
             ...
             32032, 32033, 32036, 32041, 32044, 32046, 32047, 32050, 32051,
             32052],
            dtype='int64', length=13623),
 'POLICE BOARD': Int64Index([2330, 3916], dtype='int64'),
 'PROCUREMENT': Int64Index([  166,   214,   252,   609,   697,   967,  1512,  1835,  2295,
              3424,  3531,  4251,  4447,  4487,  4895,  5146,  6243,  6404,
              6520,  7323,  8323,  8364,  9180,  9317,  9911, 10061, 10166,
             10639, 11511, 12451, 12657, 12825, 13612, 13672, 13705, 15581,
             15946, 16491, 17074, 17148, 17244, 17299, 18297, 18427, 19496,
             20888, 21103, 23263, 23672, 23878, 24017, 24566, 26418, 26829,
             26905, 27562, 27598, 27614, 27800, 28375, 28435, 29216, 29863,
             30013, 30194, 30272, 30718, 30887, 31402, 31553, 31836],
            dtype='int64'),
 'PUBLIC LIBRARY': Int64Index([   82,   125,   137,   148,   149,   241,   251,   339,   432,
               473,
             ...
             31751, 31758, 31810, 31882, 31933, 31935, 31960, 31961, 31964,
             32018],
            dtype='int64', length=926),
 'STREETS & SAN': Int64Index([   24,    29,    34,    45,    50,    51,    84,    86,    91,
               102,
             ...
             31922, 31926, 31979, 31980, 31981, 31982, 32021, 32022, 32028,
             32035],
            dtype='int64', length=2070),
 'TRANSPORTN': Int64Index([   35,    64,    99,   112,   117,   139,   147,   164,   181,
               184,
             ...
             31798, 31824, 31865, 31867, 31877, 31932, 31949, 31972, 32009,
             32042],
            dtype='int64', length=1168),
 'TREASURER': Int64Index([  276,   348,   452,  3847,  3939,  4361,  4443,  6844,  8352,
              8430,  9954, 11415, 12339, 13970, 14825, 15879, 15925, 16040,
             18768, 19837, 20229, 20379, 21785, 28293, 28817],
            dtype='int64'),
 'WATER MGMNT': Int64Index([    0,     3,    16,    26,    33,    43,    46,    66,   113,
               254,
             ...
             31923, 31952, 31953, 31954, 31967, 31977, 31978, 32002, 32030,
             32038],
            dtype='int64', length=1857)}

Get `NOT NULL` records within each column

In [131]:
by_dept.count().head()

                   name  title  salary
department
ADMIN HEARNG         42     42      42
ANIMAL CONTRL        61     61      61
AVIATION           1218   1218    1218
BOARD OF ELECTION   110    110     110
BOARD OF ETHICS       9      9       9

Get total records for each department

In [132]:
by_dept.size().head()

department
ADMIN HEARNG           42
ANIMAL CONTRL          61
AVIATION             1218
BOARD OF ELECTION     110
BOARD OF ETHICS         9
dtype: int64

 Gwt total salaries of each department

In [133]:
by_dept.sum()[20:25]

                       salary
department
HUMAN RESOURCES     4850928.0
INSPECTOR GEN       4035150.0
IPRA                7006128.0
LAW                31883920.2
LICENSE APPL COMM     65436.0

Get average salary of each department

In [134]:
by_dept.mean()[20:25]

                         salary
department
HUMAN RESOURCES    71337.176471
INSPECTOR GEN      80703.000000
IPRA               82425.035294
LAW                70853.156000
LICENSE APPL COMM  65436.000000

Get median salary of each department

In [135]:
by_dept.median()[20:25]

                    salary
department
HUMAN RESOURCES    68496.0
INSPECTOR GEN      76116.0
IPRA               82524.0
LAW                66492.0
LICENSE APPL COMM  65436.0